In [1]:
import pandas as pd

In [2]:
uriage=pd.read_csv("uriage.csv")
uriage.head()

      purchase_date item_name  item_price customer_name
0  2019-06-13 18:02       상품A       100.0           김가온
1  2019-07-13 13:05     상 품 S         NaN           김우찬
2  2019-05-11 19:42     상 품 a         NaN           김유찬
3  2019-02-12 23:40       상품Z      2600.0           김재현
4   2019-04-22 3:09       상품a         NaN           김강현

In [3]:
#먼저 pip install xlrd를 설치해야 함

In [4]:
customer_information=pd.read_excel("kokyaku_daicho.xlsx")
customer_information.head()

   고객이름  지역                  등록일
0  김 현성  H시  2018-01-04 00:00:00
1  김 도윤  E시                42782
2  김 지한  A시  2018-01-07 00:00:00
3  김 하윤  F시                42872
4  김 시온  E시                43127

### 테크닉1. 오류를 확인해보자

In [5]:
#상품명이 이상했으니까 우선 상품명 컬럼을 확인해보자
uriage["item_name"].head()

0      상품A
1    상 품 S
2    상 품 a
3      상품Z
4      상품a
Name: item_name, dtype: object

In [6]:
#아이템가격이 이상했으니까 아이템가격 컬럼도 확인해보자
#.isnull().sum() 하면 null값이 몇개인지 확인 가능
print(uriage["item_price"].isnull().sum())

#참고) 테이블 전체의 NaN값이 몇개 있는지 알아보려면
print(customer_information.isnull().sum())

387
고객이름    0
지역      0
등록일     0
dtype: int64

In [7]:
#고객명이 이상하니까 고객명 컬럼도 확인해보자
customer_information["고객이름"].head()

0    김 현성
1    김 도윤
2    김 지한
3    김 하윤
4    김 시온
Name: 고객이름, dtype: object

In [8]:
#날짜가 이상하니까 날짜 컬럼도 확인해보자
customer_information["등록일"].head()

0    2018-01-04 00:00:00
1                  42782
2    2018-01-07 00:00:00
3                  42872
4                  43127
Name: 등록일, dtype: object

### 테크닉2. 상품명 오류 수정

In [9]:
uriage["purchase_date"] = pd.to_datetime(uriage["purchase_date"])
uriage["purchase_date"] = uriage["purchase_date"].dt.strftime("%Y%m")
pivot=pd.pivot_table(uriage, index="purchase_date", columns="item_name", aggfunc="size", fill_value=0)
pivot

item_name,상 품 n,상품 E,상품 M,상품 P,상품 S,상품 W,상품 X,상품W,상 품O,상 품Q,...,상품k,상품l,상품o,상품p,상품r,상품s,상품t,상품v,상품x,상품y
purchase_date,,,,,,,,,,,,,,,,,,,,,
201901,1,0,0,0,0,0,0,0,0,0,...,1,1,1,0,0,0,0,0,0,0
201902,0,0,0,0,0,0,1,0,0,0,...,0,0,0,0,0,1,1,1,0,0
201903,0,1,1,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
201904,0,0,0,0,0,0,0,1,0,1,...,0,0,0,0,0,1,0,0,0,0
201905,0,0,0,0,1,0,0,0,0,0,...,0,1,0,0,0,0,0,0,0,1
201906,0,0,0,0,0,1,0,0,0,0,...,0,0,0,1,0,0,0,0,1,0
201907,0,0,0,0,0,0,0,0,1,0,...,0,0,1,0,2,0,0,0,0,0

In [10]:
#1단계 - item name의 종류를 전부 보여줌
pd.unique(uriage["item_name"])

array(['상품A', '상 품 S', '상 품 a', '상품Z', '상품a', '상품S', '상품 a', '상품V', '상품O',
       '상 품U', '상품L', '상  품V', '상 품O', '상품C', '상품I', '상품r', '상품X', '상품 g',
       '상품R', '상품P', '상품Q', '상품y', '상품 A', '상품N', '상품W', '상 품E', '상품K',
       '상품B', '상품F', '상 품s', ' 상품W', ' 상 품 n', '상 품F', '상품D', '상품M',
       '상품Y', '상품U', '상품H', '상품T', '상품J', '상  품O', '상품E', '상  품Q',
       ' 상품 S', ' 상품 M', '상  품T', '상품G', '상 품G', ' 상품 P', ' 상품 E', '상 품N',
       '상 품Y', '상품 J', '상품 V', '상품 K', '상 품V', '상 품D', '상 품A', '상품 F',
       '상품 H', '상 품K', '상 품T', '상품 X', '상품 Q', '상 품X', '상 품H', '상 품C',
       '상품 B', '상품 O', '상품 T', '상품v', '상품p', '상품i', '상품 w', '상 품 s',
       '상 품 q', '상품s', '상품l', '상품t', '상품k', '상품g', '상품o', '상품 R', '상품 S',
       '상 품M', '상품j', '상품d', '상품 I', '상품 E', '상품 o', '상품c', '상품 v', '상품e',
       '상품x', '상 품I', ' 상품 W', ' 상품 X', '상품 M', '상 품P'], dtype=object)

In [11]:
#2단계 - 소문자를 대문자로 바꾼 뒤 item name의 종류를 전부 보여줌, 위 셀보다 종류가 줄었음을 확인할 수 있음
uriage["item_name"]=uriage["item_name"].str.upper()
pd.unique(uriage["item_name"])

array(['상품A', '상 품 S', '상 품 A', '상품Z', '상품S', '상품 A', '상품V', '상품O',
       '상 품U', '상품L', '상  품V', '상 품O', '상품C', '상품I', '상품R', '상품X', '상품 G',
       '상품P', '상품Q', '상품Y', '상품N', '상품W', '상 품E', '상품K', '상품B', '상품F',
       '상 품S', ' 상품W', ' 상 품 N', '상 품F', '상품D', '상품M', '상품U', '상품H',
       '상품T', '상품J', '상  품O', '상품E', '상  품Q', ' 상품 S', ' 상품 M', '상  품T',
       '상품G', '상 품G', ' 상품 P', ' 상품 E', '상 품N', '상 품Y', '상품 J', '상품 V',
       '상품 K', '상 품V', '상 품D', '상 품A', '상품 F', '상품 H', '상 품K', '상 품T',
       '상품 X', '상품 Q', '상 품X', '상 품H', '상 품C', '상품 B', '상품 O', '상품 T',
       '상품 W', '상 품 Q', '상품 R', '상품 S', '상 품M', '상품 I', '상품 E', '상 품I',
       ' 상품 W', ' 상품 X', '상품 M', '상 품P'], dtype=object)

In [12]:
#3단계 - 띄어쓰기를 없앤 뒤 item name의 종류를 전부 보여줌, 위 셀보다 종류가 줄었음을 확인할 수 있음
uriage["item_name"]=uriage["item_name"].str.replace(" ", "")
pd.unique(uriage["item_name"])

array(['상품A', '상품S', '상품Z', '상품V', '상품O', '상품U', '상품L', '상품C', '상품I',
       '상품R', '상품X', '상품G', '상품P', '상품Q', '상품Y', '상품N', '상품W', '상품E',
       '상품K', '상품B', '상품F', '상품D', '상품M', '상품H', '상품T', '상품J'],
      dtype=object)

In [13]:
#unique 실행하는 다른방법
uriage["item_name"].unique()

array(['상품A', '상품S', '상품Z', '상품V', '상품O', '상품U', '상품L', '상품C', '상품I',
       '상품R', '상품X', '상품G', '상품P', '상품Q', '상품Y', '상품N', '상품W', '상품E',
       '상품K', '상품B', '상품F', '상품D', '상품M', '상품H', '상품T', '상품J'],
      dtype=object)

In [14]:
len(uriage["item_name"].unique())

26

In [15]:
#위에서 했던 방법 그대로 customer_information 시트에서 고객이름 컬럼의 중복을 업애보자
customer_information["고객이름"].unique()

array(['김 현성', '김 도윤', '김 지한', '김 하윤', '김 시온', '김 예성', '김 하람', '김 호준',
       '김 지완', '김 주호', '김 재원', '김 승민', '김 준형', '김 동건', '김 준서', '김 수혁',
       '김 진우', '김 윤호', '김 윤서', '김 준희', '김 윤우', '김 동우', '김 성빈', '김 태준',
       '김 태경', '김 승후', '김 현우', '김 서준', '김 주원', '김 태인', '김 승준', '김 윤재',
       '김 수민', '김 승훈', '김 하준', '김 하율', '김 우찬', '김 준성', '김 준혁', '김 승찬',
       '김 현승', '김 지운', '김 성민', '김 지호', '김 우준', '김 승빈', '김 재민', '김 태민',
       '김 주혁', '김 정원', '김 하랑', '김 지우', '김 예준', '김 주영', '김 민석', '김 유빈',
       '김 시훈', '김 동현', '김 라온', '김 은우', '김 민재', '김 준후', '김 현서', '김 서후',
       '김 재현', '김 유준', '김 찬우', '김 도현', '김 상민', '김 재영', '김 하진', '김 범준',
       '김 우진', '김 지훈', '김 시윤', '김 강민', '김 지성', '김 윤찬', '김 민호', '김 윤성',
       '김 지후', '김 현진', '김 태양', '김 대현', '김 재준', '김 민건', '김 도경', '김 지민',
       '김 은호', '김 민혁', '김 민찬', '김 승원', '김 정현', '김 승유', '김 세현', '김 승윤',
       '김 이준', '김 경민', '김 정훈', '김 성우', '김 은율', '김 도훈', '김 태현', '김 주안',
       '김 동욱', '김 재훈', '김 도율', '김 예찬', '김 태훈', '김 준석', '김 원준', '김 민준',
       '김 은찬', '김 영준', '김 주한', '김 현수', '김 건희', '김 규민', '김 재혁', '김 승재',
       '김 정후', '김 성현', '정 영훈', '김 민우', '김 주환', '김 준호', '김 준우', '김 시율',
       '김 도하', '김 규현', '김 주현', '김 정민', '김 건우', '정 도형', '김 연준', '김 강현',
       '김 태우', '김 지율', '김 지용', '김 지오', '김 수호', '김 가온', '김 유찬', '김 상현',
       '김 시완', '김 도원', '김 시우', '김 은성', '김 성윤', '김 우빈', '김 준수', '김 연호',
       '정 우석', '김 민규', '김 태영', '김 은혁', '김 준영', '김 지환', '김 서진', '김 서윤',
       '김 하민', '김 현준', '김 승현', '김 우영', '김 재윤', '김 한결', '김 우주', '김 지혁',
       '김 민서', '김 찬영', '김 시환', '김 수현', '김 서율', '정 준기', '김 성훈', '김 시호',
       '김 재호', '김 재우', '김 동하', '김 우현', '김 민기', '김 승환', '김 다온', '김 승우',
       '김 성준', '김 승호', '김 승주', '김 태윤', '김 민수', '김 현민', '김 유진', '김 지안',
       '김 현석', '김 선우', '김 지원', '김 재희', '김 도영', '김 이안', '김 시현', '김 서우'],
      dtype=object)

In [16]:
customer_information["고객이름"]=customer_information["고객이름"].str.replace(" ", "")
pd.unique(customer_information["고객이름"])

array(['김현성', '김도윤', '김지한', '김하윤', '김시온', '김예성', '김하람', '김호준', '김지완',
       '김주호', '김재원', '김승민', '김준형', '김동건', '김준서', '김수혁', '김진우', '김윤호',
       '김윤서', '김준희', '김윤우', '김동우', '김성빈', '김태준', '김태경', '김승후', '김현우',
       '김서준', '김주원', '김태인', '김승준', '김윤재', '김수민', '김승훈', '김하준', '김하율',
       '김우찬', '김준성', '김준혁', '김승찬', '김현승', '김지운', '김성민', '김지호', '김우준',
       '김승빈', '김재민', '김태민', '김주혁', '김정원', '김하랑', '김지우', '김예준', '김주영',
       '김민석', '김유빈', '김시훈', '김동현', '김라온', '김은우', '김민재', '김준후', '김현서',
       '김서후', '김재현', '김유준', '김찬우', '김도현', '김상민', '김재영', '김하진', '김범준',
       '김우진', '김지훈', '김시윤', '김강민', '김지성', '김윤찬', '김민호', '김윤성', '김지후',
       '김현진', '김태양', '김대현', '김재준', '김민건', '김도경', '김지민', '김은호', '김민혁',
       '김민찬', '김승원', '김정현', '김승유', '김세현', '김승윤', '김이준', '김경민', '김정훈',
       '김성우', '김은율', '김도훈', '김태현', '김주안', '김동욱', '김재훈', '김도율', '김예찬',
       '김태훈', '김준석', '김원준', '김민준', '김은찬', '김영준', '김주한', '김현수', '김건희',
       '김규민', '김재혁', '김승재', '김정후', '김성현', '정영훈', '김민우', '김주환', '김준호',
       '김준우', '김시율', '김도하', '김규현', '김주현', '김정민', '김건우', '정도형', '김연준',
       '김강현', '김태우', '김지율', '김지용', '김지오', '김수호', '김가온', '김유찬', '김상현',
       '김시완', '김도원', '김시우', '김은성', '김성윤', '김우빈', '김준수', '김연호', '정우석',
       '김민규', '김태영', '김은혁', '김준영', '김지환', '김서진', '김서윤', '김하민', '김현준',
       '김승현', '김우영', '김재윤', '김한결', '김우주', '김지혁', '김민서', '김찬영', '김시환',
       '김수현', '김서율', '정준기', '김성훈', '김시호', '김재호', '김재우', '김동하', '김우현',
       '김민기', '김승환', '김다온', '김승우', '김성준', '김승호', '김승주', '김태윤', '김민수',
       '김현민', '김유진', '김지안', '김현석', '김선우', '김지원', '김재희', '김도영', '김이안',
       '김시현', '김서우'], dtype=object)

### 테크닉3. 금액 결측치 수정

In [18]:
uriage.isnull().any() #null값이 있는지 없는지 확인하는 용도

purchase_date    False
item_name        False
item_price        True
customer_name    False
dtype: bool

loc함수 - 행을 조회함/따옴

In [20]:
city = pd.DataFrame(
    [
        ["Korea","Asia",True],
        ["USA","North America",False],
        ["France","Europe",False]
    ],
    index = ["Busan","Chicago","Paris"],
    columns = ["country","continent","port"]
)
city

        country      continent   port
Busan     Korea           Asia   True
Chicago     USA  North America  False
Paris    France         Europe  False

In [22]:
city["country"] #컬럼기준으로만 조회하는 함수, loc은 행을 기준으로 따올 수 있는 함수

Busan       Korea
Chicago       USA
Paris      France
Name: country, dtype: object

In [25]:
#loc[조건문]
city.loc[city["country"]=="Korea"]
#원하는 컬럼을 떼옴 == 그 중에서 원하는 행을 지정

      country continent  port
Busan   Korea      Asia  True

In [26]:
#loc[조건문, 조회할 컬럼명]
city.loc[city["country"]=="Korea", "continent"]
#위에서는 한 행이 다 나왔지만 여기서는 원하는 내용만 선택해서 나옴

Busan    Asia
Name: continent, dtype: object

In [27]:
#조건을 true / false로 줄 수도 있음
city.loc[city["port"]]

      country continent  port
Busan   Korea      Asia  True

In [28]:
city.loc[~city["port"]]

        country      continent   port
Chicago     USA  North America  False
Paris    France         Europe  False

In [31]:
#복합조건 - and(&), or(|) 등
#[] 및 () 유의

city.loc
[
    (city["country"]=="Korea") 
    & 
    (city["continent"]=="Europe")
]

Empty DataFrame
Columns: [country, continent, port]
Index: []

In [33]:
city.loc
[
    (city["country"]=="Korea") 
    |
    (city["continent"]=="Europe")
]

[Busan       True
 Chicago    False
 Paris       True
 dtype: bool]

In [35]:
uriage["item_price"].isnull()

0       False
1        True
2        True
3       False
4        True
        ...
2994    False
2995    False
2996     True
2997     True
2998    False
Name: item_price, Length: 2999, dtype: bool

In [41]:
uriage.loc[uriage["item_price"].isnull() == True, "item_name"]

1       상품S
2       상품A
4       상품A
6       상품A
14      상품A
       ...
2987    상품K
2990    상품O
2992    상품C
2996    상품Q
2997    상품H
Name: item_name, Length: 387, dtype: object

In [45]:
uriage.loc[uriage["item_name"]=="상품A", "item_price"].max()
#max를 쓴 이유는 null 아니면 상품값이 나올테니까 상품값을 찾기위해

100.0

In [54]:
#for문 이용해서 모든 상품의 가격 결측지를 메움, 그리고 item_price 열만 봄
uriage.loc[(uriage["item_price"].isnull())&(uriage["item_name"] == "상품A"), "item_price"]

2      NaN
4      NaN
6      NaN
14     NaN
300    NaN
361    NaN
667    NaN
838    NaN
844    NaN
957    NaN
1260   NaN
1394   NaN
1474   NaN
1892   NaN
1937   NaN
1977   NaN
2063   NaN
2278   NaN
2636   NaN
2669   NaN
2732   NaN
2821   NaN
Name: item_price, dtype: float64

In [53]:
uriage.loc[uriage["item_price"].isnull() == True, "item_name"].unique()
#상품 중 item price가 null을 다 찾음

array(['상품S', '상품A', '상품P', '상품N', '상품W', '상품R', '상품I', '상품L', '상품F',
       '상품O', '상품B', '상품C', '상품V', '상품Q', '상품U', '상품K', '상품T', '상품X',
       '상품E', '상품M', '상품G', '상품J', '상품D', '상품H', '상품Y'], dtype=object)

In [60]:
for target_item in list(uriage.loc[uriage["item_price"].isnull() == True, "item_name"].unique()):
#첫번째 for문 - target_item 안에 상품 중 item price가 null을 다 찾아서 첫번째는 상품S, 두번째는 상품A... 이런식으로 하나씩 들어옴
    standard_price = uriage.loc[uriage["item_name"]==target_item, "item_price"].max()
    #item_name이 상품S, 상품A... 하나씩 들어가는 target_item이고 item_price는 max()인 것으로 찾음, 이를 standard_price 변수로 새로 저장
    uriage.loc[(uriage["item_price"].isnull())&(uriage["item_name"] == target_item), "item_price"] = standard_price
    #for문 이용해서 모든 상품의 가격 결측지를 메움, 그리고 item_price 열만 봄
    
uriage.head()

  purchase_date item_name  item_price customer_name
0        201906       상품A       100.0           김가온
1        201907       상품S      1900.0           김우찬
2        201905       상품A       100.0           김유찬
3        201902       상품Z      2600.0           김재현
4        201904       상품A       100.0           김강현